Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: This is short for "arguments". The output might look like this:
es_es: Esta es la abreviatura de «argumentos». La salida será algo así:

source: one.c [two.c] three.c ~
es_es: uno.c [dos.c] tres.c ~

source: These are the files you started Vim with. The one you are currently editing, "two.c", is in square brackets.
es_es: Estos son los archivos con los que ha iniciado Vim. El que está editando actualmente, «dos.c», se encuentra entre corchetes.

source: This is just like the ":next" command, except that it moves in the other direction. Again, there is a shortcut command for when you want to write the file first: >
es_es: Esto es justo como la orden «:next», excepto que va en la otra dirección. Una vez más, existe una orden para cuando quiera escribir el archivo primero: >

source: You can use a count for ":next" and ":previous". To skip two files forward: >
es_es: Puede usar un multiplicador para «:next» y «:previous». Para saltar dos archivos: >

source: When moving around the files and making changes, you have to remember to use ":write". Otherwise you will get an error message. If you are sure you always want to write modified files, you can tell Vim to automatically write them: >
es_es: Cuando se mueva por los archivos y haga cambios, tiene que recordar usar «:write». En caso contrario, obtendrá mensajes de error. Si está seguro de que siempre va a escribir los archivos modificados, puede decirle a Vim que los escriba automáticamente: >

source: You can redefine the list of files without the need to exit Vim and start it again. Use this command to edit three other files: >
es_es: Puede redefinir la lista de archivos sin la necesidad de salir de Vim y arrancarlo de nuevo. Emplee esta orden para editar otros tres archivos: >

source: :args five.c six.c seven.h
es_es: :args cinco.c seis.c siete.h

source: Vim will take you to the first file in the list. Again, if the current file has changes, you can either write the file first, or use ":args!" (with ! added) to abandon the changes.
es_es: Vim le llevará al primer archivo en la lista. De nuevo, si el archivo actual cambia, puede tanto guardar el archivo antes como usar «:args!» (con el ! añadido) para abandonar los cambios.

source: DID YOU EDIT THE LAST FILE? *arglist-quit* When you use a list of files, Vim assumes you want to edit them all. To protect you from exiting too early, you will get this error when you didn't edit the last file in the list yet:
es_es: ¿HA EDITADO EL HASTA EL ÚLTIMO ARCHIVO? *arglist-quit* Cuando usa una lista de archivos, Vim asume que quiere editarlos todos. Para evitar cerrar antes de tiempo, obtendrá un error cuando no haya editado el último archivo en la lista e intentes salir.

source: If you really want to exit, just do it again. Then it will work (but not when you did other commands in between).
es_es: Si realmente desea salir, simplemente inténtelo de nuevo. Entonces funcionará (pero no si ejecuta otras órdenes durante).

source: *07.3* Jumping from file to file
es_es: *07.3* Pasar de un archivo a otro

source: To quickly jump between two files, press CTRL-^ (on English-US keyboards the ^ is above the 6 key). Example: >
es_es: Para saltar rápidamente entre dos archivos, pulse CTRL-^ (en teclados Inglés-EEUU el ^ se encuentra encima de la tecla 6). Por ejemplo: >

source: :args one.c two.c three.c
es_es: :args uno.c dos.c tres.c

source: Now you are in two.c. Now use CTRL-^ to go back to one.c. Another CTRL-^ and you are back in two.c. Another CTRL-^ and you are in one.c again. If you now do: >
es_es: Ahora está en two.c. Use CTRL-^ para volver a uno.c. Use CTRL-^ otra vez y estará de vuelta en dos.c. Otro CTRL-^ y estará en uno.c de nuevo. Si ahora hace: >

source: You are in three.c. Notice that the CTRL-^ command does not change the idea of where you are in the list of files. Only commands like ":next" and ":previous" do that.
es_es: Está en tres.c. Observe que la orden CTRL-^ no cambia la idea de dónde está en la lista de archivos. Sólo órdenes como «:next» y «:previous» lo hacen.

source: The file you were previously editing is called the "alternate" file. When you just started Vim CTRL-^ will not work, since there isn't a previous file.
es_es: El archivo que haya estado editando anteriormente se llama el archivo «alterno». Hasta que no haya un archivo anterior, CTRL-^ no funcionará.

source: This takes you to the position where the cursor was when you left the file. Another mark that is remembered is the position where you made the last change: >
es_es: Esto le lleva a la posición en la que estaba el cursor cuando salió del archivo. Otra marca que se recuerda es la posición donde hizo el último cambio: >

source: Suppose you are editing the file "one.txt". Somewhere halfway the file you use "x" to delete a character. Then you go to the last line with "G" and write the file with ":w". You edit several other files, and then use ":edit one.txt" to come back to "one.txt". If you now use `" Vim jumps to the last line of the file. Using `. takes you to the position where you deleted the character. Even when you move around in the file `" and `. will take you to the remembered position. At least until you make another change or leave the file.
es_es: Suponga que está editando el archivo «uno». En algún lugar a mitad de camino en el archivo, use «x» para eliminar un carácter. Vaya ahora a la última línea con «G» y escriba el archivo con «:w». Edite otros archivos y use «:edit uno.txt» para volver a «uno.txt». Si ahora usa `", Vim saltará a la última línea del archivo. Usar `. le llevará a la posición donde eliminó el carácter. Incluso cuando se mueva por el archivo, `" y `. le llevará a la posición recordada. Al menos hasta que realice otro cambio o salga del archivo.

source: Now edit the file "bar.txt" and place the B mark (B for bar) at its last line: > GmB
es_es: Edite ahora el archivo «bar.txt» y coloque el marcador B en su última línea: > GmB

source: Now you can use the "'F" command to jump back to halfway foo.txt. Or edit yet another file, type "'B" and you are at the end of bar.txt again.
es_es: Ahora puede usar la orden «'F» para saltar al punto marcado de foo.txt. O edite otro archivo, escriba «'B» y estará en el final de bar.txt de nuevo.

source: The file marks are remembered until they are placed somewhere else. Thus you can place the mark, do hours of editing and still be able to jump back to that mark. It's often useful to think of a simple connection between the mark letter and where it is placed. For example, use the H mark in a header file, M in a Makefile and C in a C code file.
es_es: Estas marcas de archivo se recordarán hasta que se coloquen en algún otro lugar. Así podrás colocar los marcadores, trabajar durante horas y aún tendrá la posibilidad de volver al punto marcado. Es útil pensar en una conexión sencilla entre la letra del marcador y el lugar donde se coloca. Por ejemplo, use la letra H para un archivo de cabecera (*.h), M para un Makefile y C para código C.

source: *07.4* Backup files
es_es: *07.4* Copias de seguridad

source: Usually Vim does not produce a backup file. If you want to have one, all you need to do is execute the following command: >
es_es: Habitualmente, Vim no produce copias de seguridad. Si desea que lo haga,lo único que tiene que hacer es ejecutar la siguiente orden: >

source: The name of the backup file is the original file with a ~ added to the end. If your file is named data.txt, for example, the backup file name is data.txt~. If you do not like the fact that the backup files end with ~, you can change the extension: >
es_es: El nombre del archivo de seguridad es el original con un ~ añadido al final. Si su archivo se llama datos.txt, por ejemplo, el archivo de seguridad será datos.txt~. Si no le gusta el hecho de que las copias de seguridad terminen con ~, puedes cambiar la extensión: >

source: This will use data.txt.bak instead of data.txt~. Another option that matters here is 'backupdir'. It specifies where the backup file is written. The default, to write the backup in the same directory as the original file, will mostly be the right thing.
es_es: Esto hará que Vim use datos.txt.bak en lugar de datos.txt~. Otra opción que resulta importante aquí es 'backupdir'. Especifica dónde se guardará el archivo de seguridad. La opción por omisión, escribir la copia de seguridad en el mismo directorio, es habitualmente la mejor.

source: Note: When the 'backup' option isn't set but the 'writebackup' is, Vim will still create a backup file. However, it is deleted as soon as writing the file was completed successfully. This functions as a safety against losing your original file when writing fails in some way (disk full is the most common cause; being hit by lightning might be another, although less common).
es_es: Nota: Cuando la opción 'backup' no está activada pero 'writebackup' lo está, Vim creará igualmente la copia de seguridad. Sin embargo, se eliminará tan pronto como se escriba el archivo con éxito. Esto funciona como seguridad ante la pérdida de su archivo original cuando la escritura falla por algún motivo (un disco lleno es el más habitual, un rayo puede ser otra causa aunque menos común).

source: If you are editing source files, you might want to keep the file before you make any changes. But the backup file will be overwritten each time you write the file. Thus it only contains the previous version, not the first one. To make Vim keep the original file, set the 'patchmode' option. This specifies the extension used for the first backup of a changed file. Usually you would do this: >
es_es: Si está editando archivos fuente, quizá desee mantener el archivo antes de hacer ningún cambio. Pero la copia de seguridad se sobreescribirá cada vez que escriba el archivo. Así sólo contendrá la versión previa y no la original. Para hacer que Vim mantenga el archivo original, activa la opción 'patchmode'. Esto especifica la extensión usada para la primera copia de seguridad de un archivo modificado. Habitualmente harás esto: >

source: When you now edit the file data.txt for the first time, make changes and write the file, Vim will keep a copy of the unchanged file under the name "data.txt.orig". If you make further changes to the file, Vim will notice that "data.txt.orig" already exists and leave it alone. Further backup files will then be called "data.txt~" (or whatever you specified with 'backupext'). If you leave 'patchmode' empty (that is the default), the original file will not be kept.
es_es: Cuando edite el archivo datos.txt por primera vez, haga cambios y guarde el archivo, Vim mantendrá una copia del archivo sin cambios bajo el nombre «datos.txt.orig». Si hace más cambios, Vim notará que «datos.txt.orig» ya existe y lo dejará en paz. El resto de copias de seguridad se llamarán «datos.txt~» (o lo que haya especificado con 'backupext'). Si deja 'patchmode' vacío (la opción por defecto), el archivo original no se guardará.

source: *07.5* Copy text between files
es_es: *07.5* Copiar texto entre archivos

source: :edit thisfile /This vjjjj$y
es_es: :edit estearchivo /Este vjjjj$y

source: Now edit the file you want to put the text in. Move the cursor to the character where you want the text to appear after. Use "p" to put the text there. > :edit otherfile /There p
es_es: Edite ahora el archivo donde desea poner el texto. Mueva el cursor al caracter donde quiera que el texto se coloque a continuación. Use «p» para poner el texto allí. > :edit otroarchivo /Allí p

source: Of course you can use many other commands to yank the text. For example, to select whole lines start Visual mode with "V". Or use CTRL-V to select a rectangular block. Or use "Y" to yank a single line, "yaw" to yank-a-word, etc. The "p" command puts the text after the cursor. Use "P" to put the text before the cursor. Notice that Vim remembers if you yanked a whole line or a block, and puts it back that way.
es_es: Naturalmente, podrás usar cualquiera otra orden de copia. Por ejemplo, para seleccionar líneas completas, inicie el modo Visual con «V». O pulse CTRL-V para seleccionar bloques rectangulares. Puede usar «Y» para simplemente copiar una línea, «yaw» para pegar una palabra (yank-a-word). La orden «p» pone el texto después del cursor. Use «P» para pegarlo antes del cursor. Repare en el hecho de que Vim recuerda si ha copiado una línea completa o un bloque y lo pondrá del mismo modo.

source: When you want to copy several pieces of text from one file to another, having to switch between the files and writing the target file takes a lot of time. To avoid this, copy each piece of text to its own register. A register is a place where Vim stores text. Here we will use the registers named a to z (later you will find out there are others). Let's copy a sentence to the f register (f for First): >
es_es: Cuando quiera copiar diversas porciones de un texto de un archivo a otro, tener que cambiar entre los archivos y guardarlos lleva mucho tiempo. Para evitar esto, copie cada porción en un registro independiente. Un registro es un lugar donde Vim guarda texto. Aquí usaremos los registros nombrados desde la «a» a la «z» (más tarde se percatará de que hay otros). Vamos a copiar una frase en el registro f: >

source: The "yas" command yanks a sentence like before. It's the "f that tells Vim the text should be place in the f register. This must come just before the yank command. Now yank three whole lines to the l register (l for line): >
es_es: La orden «yas» copia una frase. Es el «"f» el que le dice a Vim que el texto se debe situar en el registro f. Esto debe aparecer justo antes de la orden copiar. Ahora copie tres líneas completas en el registro l: >

source: The count could be before the "l just as well. To yank a block of text to the b (for block) register: >
es_es: El multiplicador puede situarse también antes del «"l». Para copiar un bloque de texto al registro b: >

source: Notice that the register specification "b is just before the "y" command. This is required. If you would have put it before the "w" command, it would not have worked. Now you have three pieces of text in the f, l and b registers. Edit another file, move around and place the text where you want it: >
es_es: Observe que la especificación del registro «"b» se encuentra justo antes de la orden «y». Esto es imprescindible. Si lo hubierse puesto antes de la orden «w», no habría funcionado. Ahora tiene tres porciones de texto en los registros f, l, y b. Edite otro archivo, desplácese por el texto y allá donde desee: >

source: When you delete text, you can also specify a register. Use this to move several pieces of text around. For example, to delete-a-word and write it in the w register: >
es_es: Cuando elimine texto, también puedes especificar un registro. Use esto para mover varias porciones de texto de un lado para otro. Por ejemplo, para eliminar una palabra y ponerla en el registro w (delete-a-word): >

source: :write >> logfile
es_es: :write >> archivo_registro

source: *07.6* Viewing a file
es_es: *07.6* Ver un archivo

source: Sometimes you only want to see what a file contains, without the intention to ever write it back. There is the risk that you type ":w" without thinking and overwrite the original file anyway. To avoid this, edit the file read-only. To start Vim in readonly mode, use this command: >
es_es: A veces sólo quiere ver qué contiene un archivo, sin la intención de guardar ningún cambio. Existe el riesgo de que escribas «:w» sin pensar y sobreescriba el archivo original. Para evitar esto, edite el archivo como sólo lectura. Para ejecutar Vim en modo sólo lectura, haga lo siguiente: >

source: vim -R file
es_es: vim -R archivo

source: view file
es_es: view archivo

source: You are now editing "file" in read-only mode. When you try using ":w" you will get an error message and the file won't be written. When you try to make a change to the file Vim will give you a warning:
es_es: Ahora está editando «archivo» en modo sólo lectura. Cuando pruebe a usar «:w» se dará cuenta de que aparecerá un mensaje de error y no se guardará. Cuando intente hacer un cambio al archivo, Vim le dará un aviso:

source: W10: Warning: Changing a readonly file ~
es_es: W10: Advertencia: cambiando un fichero de solo lectura ~

source: The change will be done though. This allows for formatting the file, for example, to be able to read it easily. If you make changes to a file and forgot that it was read-only, you can still write it. Add the ! to the write command to force writing.
es_es: El cambio se realizará igualmente. Esto permite formatear el archivo, por ejemplo, para facilitar su lectura. Si intenta hacer cambios a un archivo y olvidas que era de sólo lectura, aún podrá guardarlo. Añada «!» a la orden guardar para forzar la escritura.

source: Now every attempt to change the text will fail. The help files are like this, for example. If you try to make a change you get this error message:
es_es: Ahora, cualquier intento de cambiar el texto fallará. Los archivos de ayuda son así, por ejemplo. Si intenta cambiar algo, obtendrá el siguiente error:

source: E21: Cannot make changes, 'modifiable' is off ~
es_es: E21: No se pueden hacer cambios, «modifiable» está desactivado ~

source: *07.7* Changing the file name
es_es: *07.7* Cambiar el nombre de un archivo

source: A clever way to start editing a new file is by using an existing file that contains most of what you need. For example, you start writing a new program to move a file. You know that you already have a program that copies a file, thus you start with: >
es_es: Una forma inteligente de comenzar la edición de un archivo nuevo es usar un archivo similar de partida que contenga algo parecido. Por ejemplo, empiece a escribir un programa para filtrar archivos. Sabe que ya tiene un código que copia archivos, así que podría comenzar con él: >

source: :edit copy.c
es_es: :edit copiar.c

source: You can delete the stuff you don't need. Now you need to save the file under a new name. The ":saveas" command can be used for this: >
es_es: Puede eliminar lo que no necesita. A continuación tendrá que guardar el archivo bajo un nombre distinto. La orden «:saveas» es adecuado para esto: >

source: :saveas move.c
es_es: :saveas filtrar.c

source: Vim will write the file under the given name, and edit that file. Thus the next time you do ":write", it will write "move.c". "copy.c" remains unmodified. When you want to change the name of the file you are editing, but don't want to write the file, you can use this command: >
es_es: Vim escribirá el archivo con el nuevo nombre y editará el nuevo archivo. Así la próxima vez que haga «:write», escribirá «filtrar.c». «copiar.c» se mantiene sin modificaciones. Cuando desee cambiar el nombre del archivo que está editando pero no quiere escribirlo, puede usar el siguiente orden: >

source: Vim will mark the file as "not edited". This means that Vim knows this is not the file you started editing. When you try to write the file, you might get this message:
es_es: Vim marcará el archivo como «no editado». Esto significa que Vim sabe que este no es el archivo que comenzó a editar. Cuando intente guardar el archivo, puede que vea el siguiente mensaje:

source: E13: File exists (use ! to override) ~
es_es: E13: El fichero ya existe (use ! para sobreescribir) ~

source: *usr_41.txt* For Vim version 7.3. Last change: 2010 Jul 20
es_es: *usr_41.esx* Para Vim versión 7.3. Último cambio: 20/7/2010

source: Write a Vim script
es_es: Escribir scripts para Vim

source: The Vim script language is used for the startup vimrc file, syntax files, and many other things. This chapter explains the items that can be used in a Vim script. There are a lot of them, thus this is a long chapter.
es_es: El lenguaje de programación de Vim se usa en el archivo de arranque vimrc, los archivos de sintaxis, y muchas otras cosas. Este capítulo presenta y explica en detalle los elementos que componen un script de Vim. Hay muchos de ellos, por lo que éste es un capítulo largo.

source: |41.1| Introduction |41.2| Variables |41.3| Expressions |41.4| Conditionals |41.5| Executing an expression |41.6| Using functions |41.7| Defining a function |41.8| Lists and Dictionaries |41.9| Exceptions |41.10| Various remarks |41.11| Writing a plugin |41.12| Writing a filetype plugin |41.13| Writing a compiler plugin |41.14| Writing a plugin that loads quickly |41.15| Writing library scripts |41.16| Distributing Vim scripts
es_es: |41.1| Introducción |41.2| Variables |41.3| Expresiones |41.4| Estructuras de decisión |41.5| Ejecución de expresiones |41.6| Funciones |41.7| Definición de funciones |41.8| Listas y Diccionarios |41.9| Excepciones |41.10| Observaciones |41.11| Escribir extensiones |41.12| Escribir extensiones para tipo de archivo |41.13| Escribir extensiones para compiladores |41.14| Escribir extensiones que carguen rápidamente |41.15| Escribir bibliotecas |41.16| Distribuir scripts de Vim

source: Next chapter: |usr_42.txt| Add new menus Previous chapter: |usr_40.txt| Make new commands Table of contents: |usr_toc.txt|
es_es: Capítulo siguiente: |usr_42.esx| Añadir menús nuevos Capítulo anterior: |usr_40.esx| Crear órdenes nuevas Tabla de contenidos: |usr_toc.txt|

source: *41.1* Introduction *vim-script-intro* *script*
es_es: *41.1* Introducción *vim-script-intro* *script*

source: :let i = 1 :while i < 5 : echo "count is" i : let i += 1 :endwhile < Note: The ":" characters are not really needed here. You only need to use them when you type a command. In a Vim script file they can be left out. We will use them here anyway to make clear these are colon commands and make them stand out from Normal mode commands. Note: You can try out the examples by yanking the lines from the text here and executing them with :@"
es_es: :let i = 1 :while i < 5 : echo "cuenta es" i : let i += 1 :endwhile < Nota: En realidad en el ejemplo de arriba los caracteres «:» no son necesarios. Sólo es necesario su uso al escribir una orden. En los archivos de script de Vim es posible omitirlos. Aquí se muestran para evidenciar que son órdenes de la línea de órdenes, y no órdenes del modo Normal. Nota: Puede probar los ejemplos que se muestran aquí copiando el texto correspondiente, y ejecutándolo con la orden «:@"»

source: count is 1 ~ count is 2 ~ count is 3 ~ count is 4 ~
es_es: cuenta es 1 ~ cuenta es 2 ~ cuenta es 3 ~ cuenta es 4 ~

source: In the first line the ":let" command assigns a value to a variable. The generic form is: >
es_es: En la primera línea la orden «:let» le asigna un valor a una variable. La forma genérica de hacerlo es: >

source: :let {variable} = {expression}
es_es: :let {variable} = {expresión}

source: In this case the variable name is "i" and the expression is a simple value, the number one. The ":while" command starts a loop. The generic form is: >
es_es: En este caso el nombre de la variable es «i» y la expresión es simplemente un valor, el número uno. La orden «:while» inicia un ciclo. La forma genérica de esta orden es: >

source: :while {condition} : {statements} :endwhile
es_es: :while {condicion} : {instrucciones} :endwhile
